import 'package:flutter/material.dart';

class InformationPage extends StatelessWidget {
  const InformationPage({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('Информация'),
        centerTitle: true,
        backgroundColor: Colors.blueAccent,
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(16.0),
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              _buildSection(
                context,
                title: 'О приложении',
                icon: Icons.info_outline,
                content:
                    'JOJOS разработано с акцентом на эффективность, гибкость и безопасность, что делает его идеальным решением для розничных предприятий, стремящихся оптимизировать управление инвентарем и процесс продаж, обеспечивая при этом отличный пользовательский опыт.',
              ),
              _buildSection(
                context,
                title: 'Документ соглашения',
                icon: Icons.description_outlined,
                content:
           "Пользовательское соглашение для JOJOS Дата вступления в силу: С момента использования данного приложения .\n Добро пожаловать в JOJOS! Перед использованием нашего приложения внимательно ознакомьтесь с условиями данного соглашения. Использование приложения означает принятие данных условий.\n 1. Определения \n 1.1.Приложение — программное обеспечение JOJOS, предназначенное для управления складом и продажами в розничной торговле. \n 1.2. Пользователь — физическое или юридическое лицо, зарегистрированное в приложении. \n 1.3. Сервис — функции и возможности, предоставляемые через приложение Hermes_pro. \n2. Общие положения \n 2.1. Настоящее соглашение регулирует отношения между Пользователем и разработчиком приложения JOJOS (далее «Администратор»). \n 2.2. Установка и использование приложения означают согласие с условиями соглашения. \n3. Регистрация и учетная запись \n 3.1. Для использования приложения Пользователь должен зарегистрировать учетную запись, предоставив актуальную и достоверную информацию. \n 3.2. Пользователь несет ответственность за безопасность своей учетной записи и пароля. \n 3.3. В случае несанкционированного использования учетной записи Пользователь обязан незамедлительно уведомить Администратора. \n4. Использование приложения \n 4.1. Пользователь обязуется использовать приложение только в законных целях, связанных с розничной торговлей и управлением инвентарем. \n 4.2. Пользователь не имеет права:\n   - использовать приложение для осуществления мошеннической деятельности;\n   - нарушать работу приложения или пытаться получить несанкционированный доступ к сервисам.\n 4.3. Администратор оставляет за собой право приостановить или заблокировать учетную запись в случае нарушения условий соглашения.\n5. Доступ к данным\n 5.1. Пользователь соглашается на сбор и обработку данных, необходимых для функционирования приложения, в соответствии с Политикой конфиденциальности.\n 5.2. Администратор обязуется не разглашать персональные данные третьим лицам без согласия Пользователя, за исключением случаев, предусмотренных законодательством.\n6. Ограничение ответственности\n 6.1. Администратор не несет ответственности за прямой или косвенный ущерб, связанный с использованием или невозможностью использования приложения.\n 6.2. Администратор не гарантирует бесперебойную работу приложения и не несет ответственности за возможные сбои, ошибки или задержки в работе.\n7. Изменения в соглашении\n 7.1. Администратор оставляет за собой право вносить изменения в данное соглашение. Изменения вступают в силу с момента их публикации в приложении.\n 7.2. Продолжение использования приложения после внесения изменений означает согласие Пользователя с новыми условиями.\n8. Прекращение действия соглашения\n 8.1. Соглашение действует до тех пор, пока Пользователь использует приложение.\n 8.2. Пользователь может прекратить действие соглашения, удалив учетную запись и приложение.\n 8.3. Администратор имеет право прекратить действие соглашения в одностороннем порядке в случае нарушения Пользователем условий соглашения.\n 9. Заключительные положения\n 9.1. Настоящее соглашение регулируется законодательством Кыргызской Республики.\n 9.2. В случае возникновения споров стороны обязуются решать их путем переговоров. Если соглашение не будет достигнуто, спор может быть передан на рассмотрение суда в соответствии с законодательством Кыргызской Республики."

              ),
              _buildSection(
                context,
                title: 'Контакты',
                icon: Icons.contact_mail_outlined,
                content:
                    'Связаться с нами: jojoshkastorekg@gmail.com\nInstagram: Jojoshka_kg\nTelegram: @AtayPro',
              ),
              _buildSection(
                context,
                title: 'FAQ',
                icon: Icons.question_answer_outlined,
                content: 'Вопрос 1: Ответ 1...',
              ),
            ],
          ),
        ),
      ),
    );
  }

  Widget _buildSection(BuildContext context,
      {required String title, required IconData icon, required String content}) {
    return Card(
      margin: const EdgeInsets.only(bottom: 16.0),
      shape: RoundedRectangleBorder(
        borderRadius: BorderRadius.circular(12.0),
      ),
      elevation: 4.0,
      child: Padding(
        padding: const EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Row(
              children: [
                Icon(icon, color: Colors.blueAccent),
                const SizedBox(width: 8.0),
                Text(
                  title,
                  style: Theme.of(context).textTheme.titleLarge!.copyWith(
                        fontWeight: FontWeight.bold,
                      ),
                ),
              ],
            ),
            const SizedBox(height: 8.0),
            Text(
              content,
              style: Theme.of(context).textTheme.bodyMedium,
            ),
          ],
        ),
      ),
    );
  }
}
